//index.js
//获取应用实例
const app = getApp()

Page({
  data: {
    classSchedule:[
          ["周一","语文", "语文", "数学", "体育", "生命生态安全",""],
          ["周二","英语", "生命生态安全3", "语文", "美术", "音乐", "体育"],
          ["周三","语文", "数学", "体育", "音乐", "英语实践",""],
          ["周四","语文", "数学", "科学", "道德法治2", "足球", "书法"],
          ["周五","数学", "语文", "语文", "道德法治1", "美术",""]
    ],
    week:0
  },
  onLoad: function () {
 
        let week = new Date().getDay();
        this.setData({
            week:week-1
        });

  }
})
